idata = [{
	"IID": 90,
	"NAME": "Абесинский окунь",
	"EID1": "Уязвимость к холоду",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: скрытность",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Уязвимость к яду",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: восстановление",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 78,
	"NAME": "Алый корень Нирна",
	"EID1": "Урон здоровью",
	"MMOD1": 3,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Урон запасу сил",
	"MMOD2": 3,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Невидимость",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 32,
	"NAME": "Белянка",
	"EID1": "Уязвимость к холоду",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: тяжелая броня",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Восстановление магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Опустошение магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 33,
	"NAME": "Бесовский гриб",
	"EID1": "Урон здоровью",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Затяжной урон здоровью",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Паралич",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Восстановление здоровья",
	"MMOD4": 0.6,
	"TMOD4": 1,
	"VMOD4": 0.57
}, {
	"IID": 89,
	"NAME": "Бойцовая рыбка",
	"EID1": "Урон здоровью",
	"MMOD1": 2.5,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: изменение",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Замедление",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение переносимого веса",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 62,
	"NAME": "Болотный стручок",
	"EID1": "Сопротивление электричеству",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Затяжной урон магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Паралич",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Восстановление здоровья",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 50,
	"NAME": "Большие рога",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение запаса сил",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Замедление",
	"MMOD3": 1,
	"TMOD3": 6,
	"VMOD3": 1.75,
	"EID4": "Повреждение регенерации запаса сил",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 40,
	"NAME": "Бородатый мох",
	"EID1": "Урон магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение здоровья",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повреждение регенерации магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: одноручное оружие",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 16,
	"NAME": "Вересковое сердце",
	"EID1": "Восстановление магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: блокирование",
	"MMOD2": 0.5,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Паралич",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 1,
	"NAME": "Ветка чертополоха",
	"EID1": "Сопротивление холоду",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Опустошение запаса сил",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Сопротивление ядам",
	"MMOD3": 0.75,
	"TMOD3": 0,
	"VMOD3": 0.1,
	"EID4": "Повышение навыка: тяжелая броня",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 44,
	"NAME": "Виноград джазби",
	"EID1": "Уязвимость к магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Опустошение здоровья",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 99,
	"DLC": "DB",
	"NAME": "Вредозобник",
	"EID1": "Опустошение здоровья",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Опустошение запаса сил",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Опустошение магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Затяжной урон здоровью",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 63,
	"NAME": "Гигантский лишайник",
	"EID1": "Уязвимость к электричеству",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Опустошение здоровья",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Уязвимость к яду",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Восстановление магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 49,
	"NAME": "Глаз саблезуба",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Опустошение здоровья",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Урон магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Восстановление здоровья",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 34,
	"NAME": "Гниль Намиры",
	"EID1": "Урон магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: взлом",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Страх",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Регенерация здоровья",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 59,
	"NAME": "Голубой горноцвет",
	"EID1": "Восстановление здоровья",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: колдовство",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение здоровья",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повреждение регенерации магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 85,
	"NAME": "Двемерское масло",
	"EID1": "Уязвимость к магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: иллюзия",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Восстановление магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 103,
	"DLC": "DB",
	"NAME": "Древесина горелого сприггана",
	"EID1": "Уязвимость к огню",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: изменение",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повреждение регенерации магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Замедление",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 39,
	"NAME": "Жареная злокрысья кожа",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Исцеление болезней",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 0.36,
	"EID3": "Сопротивление ядам",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Восстановление здоровья",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 106,
	"DLC": "DB",
	"NAME": "Желе нетча",
	"EID1": "Паралич",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение переносимого веса",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Восстановление запаса сил",
	"MMOD3": 2,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Страх",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 105,
	"DLC": "DB",
	"NAME": "Желе пепельного прыгуна",
	"EID1": "Восстановление здоровья",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: легкая броня",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Сопротивление электричеству",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Уязвимость к холоду",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 92,
	"DLC": "DG",
	"NAME": "Желтый горноцвет",
	"EID1": "Сопротивление ядам",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение здоровья",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: восстановление",
	"MMOD3": 1.25,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повреждение регенерации запаса сил",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 69,
	"NAME": "Жемчужина",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: блокирование",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Восстановление магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление электричеству",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 42,
	"NAME": "Живица сприггана",
	"EID1": "Повреждение регенерации магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: зачарование",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: кузнечное дело",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: изменение",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 24,
	"NAME": "Жир тролля",
	"EID1": "Сопротивление ядам",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: двуручное оружие",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Бешенство",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Урон здоровью",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 20,
	"NAME": "Зубы ледяного привидения",
	"EID1": "Уязвимость к холоду",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: тяжелая броня",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Невидимость",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Уязвимость к огню",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 64,
	"NAME": "Икра рыбы-убийцы",
	"EID1": "Сопротивление ядам",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: карманные кражи",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Затяжной урон здоровью",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение запаса сил",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 108,
	"DLC": "DB",
	"NAME": "Императорский зонтичный мох",
	"EID1": "Урон здоровью",
	"MMOD1": 1.5,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация здоровья",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: двуручное оружие",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 104,
	"DLC": "DB",
	"NAME": "Кабаний клык",
	"EID1": "Повышение запаса сил",
	"MMOD1": 1.25,
	"TMOD1": 5,
	"VMOD1": 7.5,
	"EID2": "Повышение здоровья",
	"MMOD2": 5,
	"TMOD2": 1,
	"VMOD2": 5.9,
	"EID3": "Повышение навыка: блокирование",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Бешенство",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 46,
	"NAME": "Клешня грязевого краба",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Исцеление болезней",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Сопротивление ядам",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление огню",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 48,
	"NAME": "Клык саблезуба",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: тяжелая броня",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: кузнечное дело",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Уязвимость к яду",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 82,
	"NAME": "Клюв ястреба",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Сопротивление холоду",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение переносимого веса",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление электричеству",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 45,
	"NAME": "Коготь ворожеи",
	"EID1": "Сопротивление магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Затяжной урон магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: зачарование",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение искусства торговли",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 41,
	"NAME": "Корень Нирна",
	"EID1": "Урон здоровью",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 12.6,
	"EID2": "Урон запасу сил",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Невидимость",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 98,
	"DLC": "DB",
	"NAME": "Корень трамы",
	"EID1": "Уязвимость к электричеству",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение переносимого веса",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Урон магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Замедление",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 6,
	"NAME": "Костная мука",
	"EID1": "Урон запасу сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Сопротивление огню",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: колдовство",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Опустошение запаса сил",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 60,
	"NAME": "Красный горноцвет",
	"EID1": "Восстановление магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Опустошение магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Урон здоровью",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 31,
	"NAME": "Кровавый венец",
	"EID1": "Уязвимость к огню",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: блокирование",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Уязвимость к яду",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 56,
	"NAME": "Крыло лунного мотылька",
	"EID1": "Урон магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: легкая броня",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация здоровья",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Невидимость",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 57,
	"NAME": "Крыло монарха",
	"EID1": "Восстановление здоровья",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение искусства торговли",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Затяжной урон запасу сил",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Урон магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 94,
	"DLC": "DG",
	"NAME": "Крыло мотылька предка",
	"EID1": "Урон запасу сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: колдовство",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повреждение регенерации магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: зачарование",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 55,
	"NAME": "Крыло синей бабочки",
	"EID1": "Урон запасу сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: колдовство",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повреждение регенерации магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: зачарование",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 4,
	"NAME": "Куриное яйцо",
	"EID1": "Сопротивление магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повреждение регенерации магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Водное дыхание",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Затяжной урон запасу сил",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 28,
	"NAME": "Лаванда",
	"EID1": "Сопротивление магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение запаса сил",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Опустошение магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: колдовство",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 61,
	"NAME": "Лиловый горноцвет",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: скрытность",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Затяжной урон магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление холоду",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 93,
	"DLC": "HF",
	"NAME": "Лососевая икра",
	"EID1": "Водное дыхание",
	"MMOD1": 1,
	"TMOD1": 12,
	"VMOD1": 15.4,
	"EID2": "Повышение магии",
	"MMOD2": 12.5,
	"TMOD2": 0.08,
	"VMOD2": 1.05,
	"EID3": "Регенерация магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Восстановление запаса сил",
	"MMOD4": 0.4,
	"TMOD4": 1,
	"VMOD4": 0.36
}, {
	"IID": 80,
	"NAME": "Лунный сахар",
	"EID1": "Уязвимость к огню",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Сопротивление холоду",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Восстановление магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Регенерация магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 35,
	"NAME": "Лютый гриб",
	"EID1": "Урон запасу сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Бешенство",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Восстановление здоровья",
	"MMOD3": 0.6,
	"TMOD3": 1,
	"VMOD3": 0.57,
	"EID4": "Повышение навыка: кузнечное дело",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 70,
	"NAME": "Маленькая жемчужина",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: одноручное оружие",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: восстановление",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление холоду",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 51,
	"NAME": "Маленькие рога",
	"EID1": "Уязвимость к яду",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: восстановление",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Затяжной урон запасу сил",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Урон здоровью",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 47,
	"NAME": "Медвежьи когти",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 0.8,
	"TMOD1": 1,
	"VMOD1": 0.78,
	"EID2": "Повышение здоровья",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: одноручное оружие",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повреждение регенерации магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 75,
	"NAME": "Медовые соты",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: блокирование",
	"MMOD2": 0.5,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: легкая броня",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Опустошение запаса сил",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 84,
	"NAME": "Мора тапинелла",
	"EID1": "Восстановление магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Затяжной урон здоровью",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация запаса сил",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: иллюзия",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 9,
	"NAME": "Морозная мириам",
	"EID1": "Сопротивление холоду",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: скрытность",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Опустошение магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повреждение регенерации запаса сил",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 14,
	"NAME": "Морозная соль",
	"EID1": "Уязвимость к огню",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Сопротивление холоду",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Восстановление магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: колдовство",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 66,
	"NAME": "Морской желудь",
	"EID1": "Урон магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Водное дыхание",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация здоровья",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: карманные кражи",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 30,
	"NAME": "Мухомор",
	"EID1": "Сопротивление огню",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: двуручное оружие",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Бешенство",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Регенерация запаса сил",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 13,
	"NAME": "Огненная соль",
	"EID1": "Уязвимость к холоду",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Сопротивление огню",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Восстановление магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Регенерация магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 79,
	"NAME": "Оранжевая стрекоза",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Опустошение магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: карманные кражи",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Затяжной урон здоровью",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 18,
	"NAME": "Палец великана",
	"EID1": "Урон запасу сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение здоровья",
	"MMOD2": 1,
	"TMOD2": 5,
	"VMOD2": 5.9,
	"EID3": "Повышение переносимого веса",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повреждение регенерации запаса сил",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 5,
	"NAME": "Паслен",
	"EID1": "Урон здоровью",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повреждение регенерации магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Затяжной урон запасу сил",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: разрушение",
	"MMOD4": 0.8,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 72,
	"NAME": "Паучье яйцо",
	"EID1": "Урон запасу сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повреждение регенерации магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: взлом",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: стрельба",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 52,
	"NAME": "Пелена дымка",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: разрушение",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение переносимого веса",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 102,
	"DLC": "DB",
	"NAME": "Пепел порождения",
	"EID1": "Опустошение запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Сопротивление огню",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: зачарование",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Опустошение магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 107,
	"DLC": "DB",
	"NAME": "Пепельная ползучая лоза",
	"EID1": "Урон запасу сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Невидимость",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Сопротивление огню",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: разрушение",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 19,
	"NAME": "Перья ворожеи",
	"EID1": "Урон магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: колдовство",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Бешенство",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Уязвимость к электричеству",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 109,
	"DLC": "DB",
	"NAME": "Перья фельсадской крачки",
	"EID1": "Восстановление здоровья",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: легкая броня",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Исцеление болезней",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 83,
	"NAME": "Перья ястреба",
	"EID1": "Исцеление болезней",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 0.36,
	"EID2": "Повышение навыка: легкая броня",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: одноручное оружие",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: скрытность",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 77,
	"NAME": "Ползучая лоза",
	"EID1": "Восстановление магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повреждение регенерации запаса сил",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение переносимого веса",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Уязвимость к магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 26,
	"NAME": "Прах вампира",
	"EID1": "Невидимость",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Восстановление магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация здоровья",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Исцеление болезней",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 27,
	"NAME": "Пушица",
	"EID1": "Сопротивление магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: блокирование",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение искусства торговли",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 74,
	"NAME": "Пчела",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Опустошение запаса сил",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация запаса сил",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Уязвимость к электричеству",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 73,
	"NAME": "Пчелиное гнездо",
	"EID1": "Сопротивление ядам",
	"MMOD1": 0.5,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: легкая броня",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: скрытность",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: разрушение",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 29,
	"NAME": "Пшеница",
	"EID1": "Восстановление здоровья",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение здоровья",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повреждение регенерации запаса сил",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Затяжной урон магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 25,
	"NAME": "Светящаяся пыль",
	"EID1": "Урон магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повреждение регенерации магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: разрушение",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление электричеству",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 67,
	"NAME": "Светящийся гриб",
	"EID1": "Сопротивление электричеству",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: разрушение",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: кузнечное дело",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение здоровья",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 95,
	"DLC": "DG",
	"NAME": "Светящийся цветок",
	"EID1": "Сопротивление магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Страх",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация здоровья",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Паралич",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 11,
	"NAME": "Сердце даэдра",
	"EID1": "Восстановление здоровья",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повреждение регенерации запаса сил",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Урон магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Страх",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 91,
	"NAME": "Серебристый окунь",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повреждение регенерации запаса сил",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Опустошение здоровья",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление холоду",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 81,
	"NAME": "Синяя стрекоза",
	"EID1": "Сопротивление электричеству",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: карманные кражи",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Восстановление здоровья",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Страх",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 88,
	"NAME": "Сиродильский лопатохвост",
	"EID1": "Урон запасу сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: восстановление",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Страх",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Опустошение здоровья",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 2,
	"NAME": "Снежные ягоды",
	"EID1": "Сопротивление огню",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: зачарование",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Сопротивление холоду",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление электричеству",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 43,
	"NAME": "Собачий корень",
	"EID1": "Урон запасу сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: одноручное оружие",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: стрельба",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Паралич",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 58,
	"NAME": "Соль",
	"EID1": "Уязвимость к магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: восстановление",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Замедление",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Регенерация магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 15,
	"NAME": "Соль пустоты",
	"EID1": "Уязвимость к электричеству",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Сопротивление магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Урон здоровью",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 23,
	"NAME": "Стержневой корень",
	"EID1": "Уязвимость к магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: иллюзия",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Восстановление магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 97,
	"DLC": "DB",
	"NAME": "Стручок пепельной травы",
	"EID1": "Сопротивление огню",
	"MMOD1": 1.33,
	"TMOD1": 1,
	"VMOD1": 1.36,
	"EID2": "Уязвимость к электричеству",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: взлом",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: скрытность",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 53,
	"NAME": "Толченый бивень мамонта",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: скрытность",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Уязвимость к огню",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Страх",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 36,
	"NAME": "Торакс светлячка",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Затяжной урон магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Уязвимость к магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение запаса сил",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 68,
	"NAME": "Травяной стручок",
	"EID1": "Сопротивление ядам",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Опустошение магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: изменение",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Восстановление магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 100,
	"DLC": "DG",
	"NAME": "Усик коруса-охотника",
	"EID1": "Урон запасу сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: колдовство",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повреждение регенерации магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: зачарование",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 12,
	"NAME": "Ухо фалмера",
	"EID1": "Урон здоровью",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Бешенство",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Сопротивление ядам",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: взлом",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 21,
	"NAME": "Хвост злокрыса",
	"EID1": "Повреждение регенерации запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Опустошение здоровья",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Урон здоровью",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: легкая броня",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 87,
	"NAME": "Хисткарп",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повреждение регенерации запаса сил",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Водное дыхание",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 76,
	"NAME": "Человеческое сердце",
	"EID1": "Урон здоровью",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Урон магии",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повреждение регенерации магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Бешенство",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 86,
	"NAME": "Человечье мясо",
	"EID1": "Урон здоровью",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Паралич",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Восстановление магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: скрытность",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 7,
	"NAME": "Чеснок",
	"EID1": "Сопротивление ядам",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение запаса сил",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Регенерация здоровья",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 54,
	"NAME": "Чешуйчатка",
	"EID1": "Уязвимость к магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: иллюзия",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация запаса сил",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение переносимого веса",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 22,
	"NAME": "Чешуя рыбы-убийцы",
	"EID1": "Сопротивление холоду",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Затяжной урон здоровью",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: тяжелая броня",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: блокирование",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 17,
	"NAME": "Эктоплазма",
	"EID1": "Восстановление магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: разрушение",
	"MMOD2": 0.8,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Урон здоровью",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 8,
	"NAME": "Эльфийское ухо",
	"EID1": "Восстановление магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: стрельба",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Уязвимость к холоду",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление огню",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 37,
	"NAME": "Ягоды можжевельника",
	"EID1": "Уязвимость к огню",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: стрельба",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Регенерация здоровья",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повреждение регенерации запаса сил",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 38,
	"NAME": "Ядовитый колокольчик",
	"EID1": "Урон здоровью",
	"MMOD1": 1.5,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Опустошение запаса сил",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 2.1,
	"EID3": "Замедление",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Уязвимость к яду",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 101,
	"DLC": "DG",
	"NAME": "Ядовитый цветок",
	"EID1": "Урон здоровью",
	"MMOD1": 1.5,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Страх",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение переносимого веса",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Замедление",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 71,
	"NAME": "Язык дракона",
	"EID1": "Сопротивление огню",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение искусства торговли",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повышение навыка: иллюзия",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Повышение навыка: двуручное оружие",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 10,
	"NAME": "Яйцо коруса",
	"EID1": "Уязвимость к яду",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение запаса сил",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Урон магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Невидимость",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 65,
	"NAME": "Яйцо оригмы",
	"EID1": "Восстановление здоровья",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: одноручное оружие",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Урон запасу сил",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Уязвимость к магии",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 3,
	"NAME": "Яйцо соснового дрозда",
	"EID1": "Восстановление запаса сил",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Повышение навыка: взлом",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Уязвимость к яду",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Сопротивление электричеству",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}, {
	"IID": 96,
	"DLC": "HF",
	"NAME": "Яйцо ястреба",
	"EID1": "Сопротивление магии",
	"MMOD1": 1,
	"TMOD1": 1,
	"VMOD1": 1,
	"EID2": "Водное дыхание",
	"MMOD2": 1,
	"TMOD2": 1,
	"VMOD2": 1,
	"EID3": "Повреждение регенерации магии",
	"MMOD3": 1,
	"TMOD3": 1,
	"VMOD3": 1,
	"EID4": "Затяжной урон запасу сил",
	"MMOD4": 1,
	"TMOD4": 1,
	"VMOD4": 1
}]
edata = [{
	"ID": 1,
	"PN": "P",
	"EFFECT": "Исцеление болезней",
	"COST": "0.5",
	"MAG": "5",
	"DUR": "0"
}, {
	"ID": 2,
	"PN": "P",
	"EFFECT": "Противоядие",
	"COST": "0.2",
	"MAG": "2",
	"DUR": "0"
}, {
	"ID": 3,
	"PN": "N",
	"EFFECT": "Урон здоровью",
	"COST": "3",
	"MAG": "2",
	"DUR": "1"
}, {
	"ID": 4,
	"PN": "N",
	"EFFECT": "Урон магии",
	"COST": "2.2",
	"MAG": "3",
	"DUR": "0"
}, {
	"ID": 5,
	"PN": "N",
	"EFFECT": "Повреждение регенерации магии",
	"COST": "0.5",
	"MAG": "100",
	"DUR": "5"
}, {
	"ID": 6,
	"PN": "N",
	"EFFECT": "Урон запасу сил",
	"COST": "1.8",
	"MAG": "3",
	"DUR": "0"
}, {
	"ID": 7,
	"PN": "N",
	"EFFECT": "Повреждение регенерации запаса сил",
	"COST": "0.3",
	"MAG": "100",
	"DUR": "5"
}, {
	"ID": 8,
	"PN": "N",
	"EFFECT": "Страх",
	"COST": "5",
	"MAG": "1",
	"DUR": "30"
}, {
	"ID": 9,
	"PN": "P",
	"EFFECT": "Повышение навыка: изменение",
	"COST": "0.2",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 10,
	"PN": "P",
	"EFFECT": "Повышение искусства торговли",
	"COST": "2",
	"MAG": "1",
	"DUR": "30"
}, {
	"ID": 11,
	"PN": "P",
	"EFFECT": "Повышение навыка: блокирование",
	"COST": "0.5",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 12,
	"PN": "P",
	"EFFECT": "Повышение переносимого веса",
	"COST": "0.15",
	"MAG": "4",
	"DUR": "300"
}, {
	"ID": 13,
	"PN": "P",
	"EFFECT": "Повышение навыка: колдовство",
	"COST": "0.25",
	"MAG": "5",
	"DUR": "60"
}, {
	"ID": 14,
	"PN": "P",
	"EFFECT": "Повышение навыка: разрушение",
	"COST": "0.5",
	"MAG": "5",
	"DUR": "60"
}, {
	"ID": 15,
	"PN": "P",
	"EFFECT": "Повышение навыка: зачарование",
	"COST": "0.6",
	"MAG": "1",
	"DUR": "30"
}, {
	"ID": 16,
	"PN": "P",
	"EFFECT": "Повышение здоровья",
	"COST": "0.35",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 17,
	"PN": "P",
	"EFFECT": "Повышение навыка: тяжелая броня",
	"COST": "0.5",
	"MAG": "2",
	"DUR": "60"
}, {
	"ID": 18,
	"PN": "P",
	"EFFECT": "Повышение навыка: иллюзия",
	"COST": "0.4",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 19,
	"PN": "P",
	"EFFECT": "Повышение навыка: легкая броня",
	"COST": "0.5",
	"MAG": "2",
	"DUR": "60"
}, {
	"ID": 20,
	"PN": "P",
	"EFFECT": "Повышение навыка: взлом",
	"COST": "0.5",
	"MAG": "2",
	"DUR": "30"
}, {
	"ID": 21,
	"PN": "P",
	"EFFECT": "Повышение магии",
	"COST": "0.3",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 22,
	"PN": "P",
	"EFFECT": "Повышение навыка: стрельба",
	"COST": "0.5",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 23,
	"PN": "P",
	"EFFECT": "Повышение навыка: одноручное оружие",
	"COST": "0.5",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 24,
	"PN": "P",
	"EFFECT": "Повышение навыка: карманные кражи",
	"COST": "0.5",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 25,
	"PN": "P",
	"EFFECT": "Повышение навыка: восстановление",
	"COST": "0.5",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 26,
	"PN": "P",
	"EFFECT": "Повышение навыка: кузнечное дело",
	"COST": "0.75",
	"MAG": "4",
	"DUR": "30"
}, {
	"ID": 27,
	"PN": "P",
	"EFFECT": "Повышение навыка: скрытность",
	"COST": "0.5",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 28,
	"PN": "P",
	"EFFECT": "Повышение запаса сил",
	"COST": "0.3",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 29,
	"PN": "P",
	"EFFECT": "Повышение навыка: двуручное оружие",
	"COST": "0.5",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 30,
	"PN": "N",
	"EFFECT": "Бешенство",
	"COST": "15",
	"MAG": "1",
	"DUR": "10"
}, {
	"ID": 31,
	"PN": "P",
	"EFFECT": "Невидимость",
	"COST": "100",
	"MAG": "0",
	"DUR": "4"
}, {
	"ID": 32,
	"PN": "P",
	"EFFECT": "Свет",
	"COST": 0,
	"MAG": 0,
	"DUR": 0
}, {
	"ID": 33,
	"PN": "N",
	"EFFECT": "Затяжной урон здоровью",
	"COST": "12",
	"MAG": "1",
	"DUR": "10"
}, {
	"ID": 34,
	"PN": "N",
	"EFFECT": "Затяжной урон магии",
	"COST": "10",
	"MAG": "1",
	"DUR": "10"
}, {
	"ID": 35,
	"PN": "N",
	"EFFECT": "Затяжной урон запасу сил",
	"COST": "1.8",
	"MAG": "1",
	"DUR": "10"
}, {
	"ID": 36,
	"PN": "P",
	"EFFECT": "Ночное зрение",
	"COST": 0,
	"MAG": 0,
	"DUR": 0
}, {
	"ID": 37,
	"PN": "N",
	"EFFECT": "Паралич",
	"COST": "500",
	"MAG": "0",
	"DUR": "1"
}, {
	"ID": 38,
	"PN": "N",
	"EFFECT": "Опустошение здоровья",
	"COST": "0.4",
	"MAG": "2",
	"DUR": "10"
}, {
	"ID": 39,
	"PN": "N",
	"EFFECT": "Опустошение магии",
	"COST": "1",
	"MAG": "2",
	"DUR": "10"
}, {
	"ID": 40,
	"PN": "N",
	"EFFECT": "Опустошение запаса сил",
	"COST": "1.6",
	"MAG": "2",
	"DUR": "10"
}, {
	"ID": 41,
	"PN": "P",
	"EFFECT": "Регенерация здоровья",
	"COST": "0.1",
	"MAG": "5",
	"DUR": "300"
}, {
	"ID": 42,
	"PN": "P",
	"EFFECT": "Регенерация магии",
	"COST": "0.1",
	"MAG": "5",
	"DUR": "300"
}, {
	"ID": 43,
	"PN": "P",
	"EFFECT": "Регенерация запаса сил",
	"COST": "0.1",
	"MAG": "5",
	"DUR": "300"
}, {
	"ID": 44,
	"PN": "P",
	"EFFECT": "Сопротивление огню",
	"COST": "0.5",
	"MAG": "3",
	"DUR": "60"
}, {
	"ID": 45,
	"PN": "P",
	"EFFECT": "Сопротивление холоду",
	"COST": "0.5",
	"MAG": "3",
	"DUR": "60"
}, {
	"ID": 46,
	"PN": "P",
	"EFFECT": "Сопротивление магии",
	"COST": "1",
	"MAG": "1",
	"DUR": "60"
}, {
	"ID": 47,
	"PN": "P",
	"EFFECT": "Сопротивление ядам",
	"COST": "0.5",
	"MAG": "4",
	"DUR": "60"
}, {
	"ID": 48,
	"PN": "P",
	"EFFECT": "Сопротивление электричеству",
	"COST": "0.5",
	"MAG": "3",
	"DUR": "60"
}, {
	"ID": 49,
	"PN": "P",
	"EFFECT": "Восстановление здоровья",
	"COST": "0.5",
	"MAG": "5",
	"DUR": "0"
}, {
	"ID": 50,
	"PN": "P",
	"EFFECT": "Восстановление магии",
	"COST": "0.6",
	"MAG": "5",
	"DUR": "0"
}, {
	"ID": 51,
	"PN": "P",
	"EFFECT": "Восстановление запаса сил",
	"COST": "0.6",
	"MAG": "5",
	"DUR": "0"
}, {
	"ID": 52,
	"PN": "N",
	"EFFECT": "Замедление",
	"COST": "1",
	"MAG": "50",
	"DUR": "5"
}, {
	"ID": 53,
	"PN": "P",
	"EFFECT": "Поглощение магии",
	"COST": 0,
	"MAG": 0,
	"DUR": 0
}, {
	"ID": 54,
	"PN": "P",
	"EFFECT": "Водное дыхание",
	"COST": "30",
	"MAG": "0",
	"DUR": "5"
}, {
	"ID": 55,
	"PN": "N",
	"EFFECT": "Уязвимость к огню",
	"COST": "0.6",
	"MAG": "3",
	"DUR": "30"
}, {
	"ID": 56,
	"PN": "N",
	"EFFECT": "Уязвимость к холоду",
	"COST": "0.5",
	"MAG": "3",
	"DUR": "30"
}, {
	"ID": 57,
	"PN": "N",
	"EFFECT": "Уязвимость к магии",
	"COST": "1",
	"MAG": "2",
	"DUR": "30"
}, {
	"ID": 58,
	"PN": "N",
	"EFFECT": "Уязвимость к яду",
	"COST": "1",
	"MAG": "2",
	"DUR": "30"
}, {
	"ID": 59,
	"PN": "N",
	"EFFECT": "Уязвимость к электричеству",
	"COST": "0.7",
	"MAG": "3",
	"DUR": "30"
}]

for (i in edata) {
	edata[i].ID--
};
for (i in idata) {
	idata[i].IID--
};
for (let e in edata) {
	edata[e].INGREDIENTS = [];
	for (let i in idata) {
		if (idata[i].EID1 == edata[e].EFFECT) {
			edata[e].INGREDIENTS.push(idata[i].IID.toString());
			idata[i].EID1 = edata[e].ID
		};
		if (idata[i].EID2 == edata[e].EFFECT) {
			edata[e].INGREDIENTS.push(idata[i].IID.toString());
			idata[i].EID2 = edata[e].ID
		};
		if (idata[i].EID3 == edata[e].EFFECT) {
			edata[e].INGREDIENTS.push(idata[i].IID.toString());
			idata[i].EID3 = edata[e].ID
		};
		if (idata[i].EID4 == edata[e].EFFECT) {
			edata[e].INGREDIENTS.push(idata[i].IID.toString());
			idata[i].EID4 = edata[e].ID
		};
	};
};
edata.sort(function(a, b) {
	if (a.ID > b.ID) {
		return 1;
	}
	if (a.ID < b.ID) {
		return -1;
	} else {
		return 0;
	};
});
idata.sort(function(a, b) {
	if (a.IID > b.IID) {
		return 1;
	}
	if (a.IID < b.IID) {
		return -1;
	} else {
		return 0;
	};
});

function Calculator() {
	let target = document.getElementById("content")
	target.innerHTML =
		'<div id="controls">' +
		'<button class="btn-cc" onclick="Calculate()">ПОИСК</button><button class="btn-cc" onclick="ClearFilter()">СБРОСИТЬ ФИЛЬТР</button>' +
		'</div>' +
		'<div id="calcarea"></div>';
	ListEffects();
};

function Calculate() {
	let effs = $('#efilter').serializeArray();
	if (effs.length!=0){
		if (effs.length == 1) {
			pots = Pots1(effs[0].value)
		} else {
			pots = tpots;
		}
		pots=pots.sort(function(a,b){
			if(a[1][0][2]>b[1][0][2]){return 1}else{return-1};
		})
		target = document.getElementById("calcarea");
		target.innerHTML = '<div id="calculated" class="pots"></div>';
		target = document.getElementById("calculated");
		document.getElementById("controls").innerHTML=
			'<div><button class="btn-cc" onclick="Calculator()">ВЕРНУТЬСЯ К ВЫБОРУ ЭФФЕКТОВ</button>'+
			'<div class="potfilters"><input hidden type="text" placeholder="Фильтр по ингредиенту"></div>'
		for (let pot of pots) { //potion, potname, potefs
			pid='';
			pname=[]
			for (let ingredient of pot[0]){pid+=ingredient.toString();pname.push(ingredient)};
			console.log(pid);
			target.innerHTML +='<div class="potion"><div class="potname" id="n'+pid+'"></div><div class="potefs" id="e'+pid+'"></div></div>';
			target=document.getElementById("n"+pid);
			for (let i of pname){
				target.innerHTML+=idata[i].NAME+'<br>+<br>';
			};
			target.innerHTML=target.innerHTML.slice(0,-9);
			target=document.getElementById("e"+pid);
			for (e of pot[1]){
				target.innerHTML+=edata[e[0]].EFFECT;
				if ( ![0,1].includes( e[1][0] ) ){target.innerHTML+= " СИЛ *"+ e[1][0] };
				if ( ![0,1].includes( e[1][1] ) ){target.innerHTML+= " ВРМ *"+ e[1][1] };
				if ( ![0,1].includes( e[1][2] ) ){target.innerHTML+= " СТМ *"+ e[1][2] };
				target.innerHTML+="<br>";

			}
		target = document.getElementById("calculated");


		}
	}

}

function Pots1(eid) {
	pots = []
	ipool = edata[eid].INGREDIENTS
	for (i = 0; i < ipool.length - 1; i++) {
		ai = idata[ipool[i]]
		a = [];
		a.push([ai.EID1, [ai.MMOD1, ai.TMOD1, ai.VMOD1]]);
		a.push([ai.EID2, [ai.MMOD2, ai.TMOD2, ai.VMOD2]]);
		a.push([ai.EID3, [ai.MMOD3, ai.TMOD3, ai.VMOD3]]);
		a.push([ai.EID4, [ai.MMOD4, ai.TMOD4, ai.VMOD4]]);
		for (let j = i + 1; j < ipool.length; j++) {
			pot = []
			let bi = idata[ipool[j]];
			b = [];
			b.push([bi.EID1, [bi.MMOD1, bi.TMOD1, bi.VMOD1]]);
			b.push([bi.EID2, [bi.MMOD2, bi.TMOD2, bi.VMOD2]]);
			b.push([bi.EID3, [bi.MMOD3, bi.TMOD3, bi.VMOD3]]);
			b.push([bi.EID4, [bi.MMOD4, bi.TMOD4, bi.VMOD4]]);
			for (efa of a) {
				for (efb of b) {
					if (efa[0] == efb[0]) {
						if (efa[1][2] >= efb[1][2]) {
							pot.push(efa)
						} else {
							pot.push(efb)
						};
					}
				}
			}

			if (pot.length==1){pots.push([[ipool[i], ipool[j]], pot]);};
		}
	}
	return pots
}

function ClearFilter() {
	for (i = 0; i < edata.length; i++) {
		if (document.getElementsByName(i)[0].checked = true) {
			document.getElementsByName(i)[0].checked = false
		}
	};
	Refilter();
}

function Refilter() {
	for (i = 0; i < edata.length; i++) {
		document.getElementsByName(i)[0].parentElement.style.display = "";
		document.getElementsByName(i)[0].disabled = false
	};
	let effs = $('#efilter').serializeArray();
	if (effs.length == 1) {
		let eid = effs[0].value;
		let epool = []
		for (ing of edata[eid].INGREDIENTS) {
			if (!epool.includes(idata[ing].EID1)) {
				epool.push(idata[ing].EID1)
			};
			if (!epool.includes(idata[ing].EID2)) {
				epool.push(idata[ing].EID2)
			};
			if (!epool.includes(idata[ing].EID3)) {
				epool.push(idata[ing].EID3)
			};
			if (!epool.includes(idata[ing].EID4)) {
				epool.push(idata[ing].EID4)
			};
		};
		for (i = 0; i < edata.length; i++) {
			if (!epool.includes(i)) {
				document.getElementsByName(i)[0].parentElement.style.display = "none"
			}
		};
	};

	if (effs.length == 2) {
		let eids = [];
		for (i of effs) {
			eids.push(parseInt(i.value))
		};
		console.log(eids)
		i1pool = [];
		for (let i of idata) { //у каких ингредиентов есть оба эффекта?
			let e = [i.EID1, i.EID2, i.EID3, i.EID4];
			if (e.includes(eids[1]) && e.includes(eids[0])) {
				i1pool.push(i.IID)
			}
		};
		i2pool = edata[eids[0]].INGREDIENTS; //ингредиенты для 1 эффекта (ID)
		i3pool = edata[eids[1]].INGREDIENTS; //ингредиенты для 2 эффекта (ID)
		tpots = [];
		for (let i1 of i1pool) {
			ef1 = [[idata[i1].EID1, [idata[i1].MMOD1, idata[i1].TMOD1, idata[i1].VMOD1]],[idata[i1].EID2,[idata[i1].MMOD2,idata[i1].TMOD2,idata[i1].VMOD2]],[idata[i1].EID3, [idata[i1].MMOD3, idata[i1].TMOD3, idata[i1].VMOD3]],[ idata[i1].EID4, [idata[i1].MMOD4, idata[i1].TMOD4, idata[i1].VMOD4 ] ]];			
			for (let i2 of i2pool) { 
				if (i1!=i2){
					ef2 =[[idata[i2].EID1, [idata[i2].MMOD1, idata[i2].TMOD1, idata[i2].VMOD1 ] ],[ idata[i2].EID2, [idata[i2].MMOD2, idata[i2].TMOD2, idata[i2].VMOD2 ] ],[ idata[i2].EID3, [idata[i2].MMOD3, idata[i2].TMOD3, idata[i2].VMOD3 ] ],[ idata[i2].EID4, [idata[i2].MMOD4, idata[i2].TMOD4, idata[i2].VMOD4 ] ]];
					for (let i3 of i3pool) {
						pefl = [];
						if (i1 != i2 && i2 != i3 && i1 != i3) {
							pot = [];
							
							ef3 =[[ idata[i3].EID1, [idata[i3].MMOD1, idata[i3].TMOD1, idata[i3].VMOD1 ] ],[ idata[i3].EID2, [idata[i3].MMOD2, idata[i3].TMOD2, idata[i3].VMOD2 ] ],[ idata[i3].EID3, [idata[i3].MMOD3, idata[i3].TMOD3, idata[i3].VMOD3 ] ],[ idata[i3].EID4, [idata[i3].MMOD4, idata[i3].TMOD4, idata[i3].VMOD4 ] ]];

							for (let i = 0; i < 4; i++) { //1||2 проверка
								for (let j = 0; j < 4; j++) {
									if (!pefl.includes(ef1[i][0]) && ef1[i][0] == ef2[j][0]) {
										pefl.push(ef1[i][0]);
										if (ef1[i][1][2]>ef2[j][1][2]){
											pot.push(ef1[i])
										}else{pot.push(ef2[j])};
									}
								}
							};
							for (let i = 0; i < 4; i++) { //1||3 проверка
								for (let j = 0; j < 4; j++) {
									if (!pefl.includes(ef1[i][0]) && ef1[i][0] == ef3[j][0]) {
										pefl.push(ef1[i][0]);
										if (ef1[i][1][2]>ef3[j][1][2]){
											pot.push(ef1[i])
										}else{pot.push(ef3[j])};
									}
								}
							};
							for (let i = 0; i < 4; i++) { //2||3 проверка
								for (let j = 0; j < 4; j++) {
									if (!pefl.includes(ef2[i][0]) && ef2[i][0] == ef3[j][0]) {
										pefl.push(ef2[i][0]);
										if (ef2[i][1][2]>ef3[j][1][2]){
											pot.push(ef2[i])
										}else{pot.push(ef3[j])};
									}
								}
							};
						};

						if ( pefl.includes(eids[0] ) && pefl.includes(eids[1]) ) {	tpots.push([[i1, i2, i3].sort(), pot])
						};
					}
				}

			}
		}
		for (let i = 0; i < tpots.length - 1; i++) {
			for (j = i + 1; j < tpots.length; j++) {
				if (tpots[i][0].toString() == tpots[j][0].toString()) {
					tpots.splice(j, 1)
				}
			}
		};
		for (i = 0; i < edata.length; i++) {
			if (!document.getElementsByName(i)[0].checked) {
				document.getElementsByName(i)[0].disabled = true
			}
		};
		epool = eids;
		for (i of tpots) {
			for (j of i[1]) {
				if (!epool.includes(j) && j != eids[1] && j != eids[0]) {
					epool.push(j)
				}
			}
		}
		for (i = 0; i < edata.length; i++) {
			if (!epool.includes(i)) {
				document.getElementsByName(i)[0].parentElement.style.display = "none"
			}
		};
	};
};

function ListEffects() {
	document.getElementById("calcarea").innerHTML = '<div id="elist"></div>';
	let target = document.getElementById("elist");
	target.innerHTML += '<form id="efilter"><div id="positives" style="width:50%; float:left"></div><div id="negatives" style="width:50%; float:right;"></div></form>'
	positives = document.getElementById("positives");
	negatives = document.getElementById("negatives");

	for (item of edata) {
		if (item.PN == "P") {
			positives.innerHTML +=
				'<div class="effect"><label>' +
				'<input  type="checkbox" name="' + item.ID + '" value="' + item.ID + '" onclick="Refilter()"><span>' +
				item.EFFECT + '</span></label></div>'
		} else {
			negatives.innerHTML +=
				'<div class="effect"><label>' +
				'<input  type="checkbox" name="' + item.ID + '" value="' + item.ID + '" onclick="Refilter()"><span>' +
				item.EFFECT + '</span></label></div>'
		}
	}
};

/*function GetVal(){
	const val = document.getElementById("type").value;
	if (val == "Ingredient"){
		console.log('qq');
		S_Ingredients();
	};
	if (val == "Effect"){
		console.log('ef');
		S_Effects();
	};
}

//ingredients

function S_Ingredients(){
      document.getElementById('search').onkeyup = function() {
           document.getElementById('data').innerHTML = '';
           if(this.value.toLowerCase().length > 1) {
            for (let ingredient of idata){
                  if (ingredient.NAME.toLowerCase().includes(this.value.toLowerCase())){
                        document.getElementById('data').innerHTML +=
                              '<div id = "idata'+ingredient.IID+'">'+
                                    '<button class = "item" onclick=tgEffects('+ingredient.IID+')>'+ ingredient.NAME+ '</button>'+
                                    '<div class = "IngredientEffects" id = "efflist'+ ingredient.IID +'">'+
                                    '</div>'+
                              '</div>'
                  }
            }
           }

      }
}
*/
